app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if Artist.exists?(params[:artist_id])
        @songs = Artist.find(params[:artist_id]).songs
      else
        redirect_to artists_path, alert: "Artist not found."
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? LIMIT 1  [["artist_id", 5]]
SELECT "songs".* FROM "songs"

  def show
    if Song.exists?(params[:id])
      if Song.artist
        @song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs"
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]